
#+BEGIN_SRC R  :results output raw  :exports results  :session *R* :cache no
library(lava)
m <- lvm(~X1+X2+X3+eventtime+censtime+Noise)
distribution(m,"X2") <- binomial.lvm()
distribution(m,"X3") <- binomial.lvm()
distribution(m,"eventtime") <- coxWeibull.lvm(scale=1/100)
distribution(m,"censtime") <- coxWeibull.lvm(scale=1/100)
regression(m,to="eventtime",from=c("X1","X2","X3")) <- c(0.6,-0.7,0.7)
m <- eventTime(m,time~min(eventtime=1,censtime=0),"event")
set.seed(17)
d <- sim(m,100)
#+END_SRC

#+RESULTS:
Loading required package: numDeriv
Loading 'lava' version 1.2.0

#+BEGIN_SRC R  :results output raw  :exports results  :session *R* :cache yes 
library(prodlim)

f0 <- prodlim(Hist(time,event)~1,data=d)
f1 <- prodlim(Hist(time,event)~X1,data=d)
f2 <- prodlim(Hist(time,event)~X2,data=d)
f23 <- prodlim(Hist(time,event)~X2+X3,data=d)
f123 <- prodlim(Hist(time,event)~X1+X2+X3,data=d)
f0 <- prodlim(Surv(time,event)~1,data=d)
f1 <- prodlim(Surv(time,event)~X1,data=d)
f2 <- prodlim(Surv(time,event)~X2,data=d)
f23 <- prodlim(Surv(time,event)~X2+X3,data=d)
f123 <- prodlim(Surv(time,event)~X1+X2+X3,data=d)
u <- Hist(time,event)~X1+X2+X3
f123 <- prodlim(u,data=d)
#+END_SRC

#+BEGIN_SRC R  :results output raw  :exports results  :session *R* :cache yes 



gsub("(\\w*)-(a-z)", "\\2", "sadfs-sd")

gsub(".*([a-z])", "\\1", "a(b(ab))")


pl <- function(formula,data){
model.frame(formula,data)

}

#+END_SRC


